package;

class A {
	// Динамическое поле
	public var i : Int;
	// Статическое поле
	public static var j : Int;

	public function new () { }

	// Динамический метод
	public function M1 () { trace("Динамический метод: " + this.i); }
	// Статический метод
	public static function M2 () { trace("Статический метод: " + A.j); }
}

class Main {
	public static function main () {
		//----------------------------------------------------------------------
		trace("--- Доступ к динамическому полю и вызов динамического метода ---");
		
		var a : A = new A();
		a.i = 12;
		a.M1();

		//----------------------------------------------------------------------
		trace("--- Доступ к статическому полю и вызов статического метода ---");

		A.j = 433;
		A.M2();
	}
}
