package;

import haxe.ds.Vector;

class Main {
	public static function main () {
		//----------------------------------------------------------------------
		trace('--- Создать новый вектор с 10 элементами ---');
		
		var a = new Vector<Int>(10);
		for (i in 0...10) {
			a.set(i, 50 - i);
		}
		trace(a);

		//----------------------------------------------------------------------
		trace('--- Длина: ' + a.length + ' ---');

		//----------------------------------------------------------------------
		trace('--- Получить элементы по индексу ---');

		for (i in 0...a.length) {
			trace(i + ' = ' + a.get(i));
		}

		//----------------------------------------------------------------------
		trace('--- Слияние двух векторов ---');

		var b = new Vector<Int>(10);
		for (i in 0...10) {
			 b.set(i, i * 100);
		}
		trace(b);

		Vector.blit(b, 5, a, 3, 3);
		trace(a);

		//----------------------------------------------------------------------
		trace('--- Получить массив данных из вектора ---');

		var c = a.toArray();
		trace(c);

		//----------------------------------------------------------------------
		trace('--- Получить вектор из массива данных ---');

		var d = Vector.fromArrayCopy([30, 20, 5, 8, 11]);
		trace(d);
	}
}
