package;

using Lambda;

class Main {
	public static function main () {
		//----------------------------------------------------------------------
		trace('--- Новый массив ---');
		
		var words = ['car', 'boat', 'cat', 'frog'];
		trace(words);

		//----------------------------------------------------------------------
		trace('--- Массив пуст? ---');
		
		trace(words.empty());

		//----------------------------------------------------------------------
		trace('--- Количество элементов ---');
		
		trace(words.count());

		//----------------------------------------------------------------------
		trace('--- Находится ли элемент boat в массиве? ---');
		
		trace(words.has('boat'));

		//----------------------------------------------------------------------
		trace('--- Находится ли элемент FROG в массиве? ---');
		
		trace(words.exists(function(word) { return word.toUpperCase() == 'FROG'; }));

		//----------------------------------------------------------------------
		trace('--- Применение фильтра ---');
		
		trace(words.filter(function(word) { return word.length == 3; }));

		//----------------------------------------------------------------------
		trace('--- Изменение каждого элемента ---');
		
		trace(words.map(function(word) { return word.toUpperCase(); }));

		//----------------------------------------------------------------------
		trace('--- Поиск элемента, начинающегося на букву c ---');
		
		trace(words.find(function(word) { return word.substr(0, 1) == 'c'; }));

		//----------------------------------------------------------------------
		trace('--- Индекс элемента cat ---');
		
		trace(words.indexOf('cat'));
	}
}
