package;

import haxe.ds.GenericStack;

class Main {
	public static function main () {
		//----------------------------------------------------------------------
		trace('--- Создать новый ассоциативный массив ---');
		
		var a:Map<Int, String> = new Map<Int, String>();
		
		//----------------------------------------------------------------------
		trace('--- Добавить 3 элемента ---');

		a.set(1, 'one');
		a.set(2, 'two');
		a.set(3, 'three');
		trace(a);

		//----------------------------------------------------------------------
		trace('--- Добавить 3 элемента ---');

		a.arrayWrite(5, 'five');
		a.arrayWrite(4, 'four');
		a.arrayWrite(10, 'ten');
		trace(a);

		//----------------------------------------------------------------------
		trace('--- Добавить 3 элемента ---');

		a.set(20, 'twenty');
		a.set(30, 'thirty');
		a.set(40, 'fourty');
		trace(a);

		//----------------------------------------------------------------------
		trace('--- Существует ли ключ 3? ' + a.exists(3) + ' ---');

		//----------------------------------------------------------------------
		trace('--- Существует ли ключ 100500? ' + a.exists(100500) + ' ---');

		//----------------------------------------------------------------------
		trace('--- Значение ключа 3: ' + a.get(3) + ' ---');

		//----------------------------------------------------------------------
		trace('--- Значение ключа 100500: ' + a.get(100500) + ' ---');

		//----------------------------------------------------------------------
		trace('--- Удалить значения 3 и 30 ---');
		
		a.remove(3);
		a.remove(30);
		trace(a);
	}
}
