package;

class Main {
	public static function main () {
		//----------------------------------------------------------------------
		trace('--- Создать новый массив ---');
		
		var a = new Array<Int>();
		a[0] = 1;
		a[1] = 2;
		a[2] = 3;
		trace(a);

		//----------------------------------------------------------------------
		trace('--- Длина: ' + a.length + ' ---');

		//----------------------------------------------------------------------
		trace('--- Присоединить массив ---');

		var b = a.concat([17, 16, 15, 14, 13]);
		trace(a);
		trace(b);

		//----------------------------------------------------------------------
		trace('--- Копировать массив ---');

		var c = b.copy();
		trace(b);
		trace(c);

		//----------------------------------------------------------------------
		trace('--- Удалить первый элемент массива ---');
		trace(c.shift());
		trace(c);

		//----------------------------------------------------------------------
		trace('--- Удалить последний элемент массива ---');
		trace(c.pop());
		trace(c);

		//----------------------------------------------------------------------
		trace('--- Добавить элемент в конец массива ---');
		c.push(1024);
		trace(c);

		//----------------------------------------------------------------------
		trace('--- Удалить элементы 3, 1000 и 15 ---');
		trace(c.remove(3));
		trace(c.remove(1000));
		trace(c.remove(15));
		trace(c);

		//----------------------------------------------------------------------
		trace('--- Реверс массива ---');
		c.reverse();
		trace(c);

		//----------------------------------------------------------------------
		trace('--- Копирование диапазона ячеек ---');
		var d = c.slice(1, 4);
		trace(d);

		//-------------------------------
		trace('--- Представление массива ввиде строки ---');
		trace(d.join(" --> "));
	}
}
