package;

class Main {
	public static function main () {
		//----------------------------------------------------------------------
		trace('--- Создать новый список ---');
		
		var a = new List<Int>();
		
		//----------------------------------------------------------------------
		trace('--- Список пуст: ' + a.isEmpty() + ' ---');

		//----------------------------------------------------------------------
		trace('--- Добавить элементы в конец списка ---');
		
		a.add(3);
		a.add(2);
		a.add(1);
		a.add(5);
		a.add(6);
		trace(a);
		
		//----------------------------------------------------------------------
		trace('--- Список пуст: ' + a.isEmpty() + ' ---');

		//----------------------------------------------------------------------
		trace('--- Длина: ' + a.length + ' ---');

		//----------------------------------------------------------------------
		trace('--- Добавить элементы в начало списка ---');
		
		a.push(0);
		a.push(20);
		a.push(10);
		a.push(50);
		a.push(60);
		trace(a);

		//----------------------------------------------------------------------
		trace('--- Первый элемент списка: ' + a.first() + ' ---');

		//----------------------------------------------------------------------
		trace('--- Последний элемент списка: ' + a.last() + ' ---');

		//----------------------------------------------------------------------
		trace('--- Удалить элементы 3, 100, 50 и 20 из списка ---');

		trace("Удалён элемент с индексом: " + a.remove(3));
		trace("Удалён элемент с индексом: " + a.remove(100));
		trace("Удалён элемент с индексом: " + a.remove(50));
		trace("Удалён элемент с индексом: " + a.remove(20));
		trace(a);

		//----------------------------------------------------------------------
		trace('--- Приведение к строке: ' + a.toString() + ' ---');
		
		//----------------------------------------------------------------------
		trace('--- Приведение к строке с указанием разделителя: ' + a.join('-->') + ' ---');

		//----------------------------------------------------------------------
		trace('--- Фильтрация элементов ---');
		trace(a.filter(function (i) { return i > 5 && i < 40; }));

		//----------------------------------------------------------------------
		trace('--- Изменение представления элементов ---');
		trace(a.map(function (i) { return i * 100; }));
	}
}
