package;

import haxe.ds.GenericStack;

class Main {
	public static function main () {
		//----------------------------------------------------------------------
		trace('--- Создать новый список ---');
		
		var a = new GenericStack<Int>();
		
		//----------------------------------------------------------------------
		trace('--- Стек пуст: ' + a.isEmpty() + ' ---');

		//----------------------------------------------------------------------
		trace('--- Добавить элементы в стек ---');
		
		a.add(3);
		a.add(2);
		a.add(1);
		a.add(0);
		a.add(11);
		a.add(18);
		a.add(5);
		a.add(6);
		trace(a);
		
		//----------------------------------------------------------------------
		trace('--- Стек пуст: ' + a.isEmpty() + ' ---');

		//----------------------------------------------------------------------
		trace('--- Верхний элемент стека: ' + a.head.elt + ' ---');
		trace('--- Следующий элемент стека: ' + a.head.next.elt + ' ---');
		trace('--- Следующий элемент стека: ' + a.head.next.next.elt + ' ---');

		//----------------------------------------------------------------------
		trace('--- Удалить элементы 1, 8 и 5 ---');

		trace(a.remove(1));
		trace(a.remove(8));
		trace(a.remove(5));
		trace(a);

		//----------------------------------------------------------------------
		trace('--- Получить 3 верхних элемента ---');

		trace(a.pop());
		trace(a.pop());
		trace(a.pop());
		trace(a);

		//----------------------------------------------------------------------
		trace('--- Приведение к строке: ' + a.toString() + ' ---');
	}
}
